"use strict"; 

// Git - программа-система контроля версий. Создает точки отсчета изменений
// GitHub - хранилище удаленных репозиториев.

// git init - инициализирует рабочую папку, создает файл .git.
// Чтоб посмотреть скрытые файлы нужно ввести "command"+"shift"+"."

// git config --local use.name "Tatyko" - локально, только в рамках одного конкретного проекта.
// git config --global use.name "Tatyko" - глобально, на весь компьютер и проекты


// git add -A - добавить все ALL файлы в "вотчер" гита.
// git add main.css - вместо "-А", можно добавить клонкретный файл, написав его название и расширение.
// git add *.css - звездочка доабвляет все файлы одного расширения.

// git status - проверяет есть ли коммиты, изменения в файлах в однйо определенной ветке, например в master.
